app/controllers/institutions_controller.rb

SELECT * FROM "institutions"
---
  def index
    @institutions = Institution.all

SELECT * FROM "institutions" WHERE ("institutions"."id" = 1)
---
  def show
    @institution = Institution.find(params[:id])

SELECT * FROM "service_levels"
---
  def new
    @institution = Institution.new
    @service_levels = ServiceLevel.all

SELECT * FROM "institutions" WHERE ("institutions"."id" = 1)
SELECT * FROM "service_levels"
---
  def edit
    @institution = Institution.find(params[:id])
    @service_levels = ServiceLevel.all

INSERT INTO "institutions" ("name", "created_at", "updated_at") VALUES('ADELAIDE DIAS', '2010-12-07 14:05:20', '2010-12-07 14:05:20')
SELECT * FROM "segments" INNER JOIN "segments_service_levels" ON "segments".id = "segments_service_levels".segment_id WHERE ("segments_service_levels".service_level_id = 1 )
INSERT INTO "institutions_service_levels" ("service_level_id", "institution_id") VALUES (1, 2)
INSERT INTO "users" ("service_level_id", "segment_id", "created_at", "updated_at", "institution_id", "password") VALUES(1, 1, '2010-12-08 02:44:14', '2010-12-08 02:44:14', 3, NULL)
---
  def create
    @institution = Institution.new(params[:institution])

    respond_to do |format|
      if @institution.save
        @institution.service_levels.each do |sl|
          sl.segments.each do |segment|
            @user = User.new(:institution_id => @institution.id, :service_level_id => sl.id,
                             :segment_id => segment.id, :password => nil )
            @user.save

SELECT * FROM "institutions" WHERE ("institutions"."id" = 1)
---
  def update
    @institution = Institution.find(params[:id])

SELECT * FROM "institutions" WHERE ("institutions"."id" = 2)
DELETE FROM "institutions" WHERE "id" = 2
---
  def destroy
    @institution = Institution.find(params[:id])
    @institution.destroy