app/controllers/questions_controller.rb

  def index
    @questions = Question.all.sort
---
SELECT * FROM "questions"