app/controllers/session_controller.rb

  def index
    @institution_name = Institution.find(current_user.institution_id).name
    service_level_name = ServiceLevel.find(current_user.service_level_id).name
    segment_name = Segment.find(current_user.segment_id).name
---
SELECT * FROM "institutions" WHERE ("institutions"."id" = 3)
SELECT * FROM "service_levels" WHERE ("service_levels"."id" = 1)
SELECT * FROM "segments" WHERE ("segments"."id" = 5)

  def new
    @institutions = Institution.all(:order => "name")
    @service_levels = ServiceLevel.all
    @segments = Segment.all
---
SELECT * FROM "institutions"
SELECT * FROM "service_levels"
SELECT * FROM "segments"