app/controllers/surveys_controller.rb

  def index
    @surveys = Survey.all
---
SELECT * FROM "surveys"